---
kind: type
id: T:Autodesk.Revit.DB.DirectContext3D.ClipPlane
source: html/eebd15b6-2643-3d82-696b-59ee5618f11b.htm
---
# Autodesk.Revit.DB.DirectContext3D.ClipPlane

A set of parameters representing a clip plane in DirectContext3D.

## Syntax (C#)
```csharp
public class ClipPlane : IDisposable
```